#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation ✅`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.postgresql-flexible-server.random_password.this: Refreshing state... [id=none]
module.postgresql-flexible-server.random_string.this: Refreshing state... [id=buwXXglHafg3rhu5]
module.postgresql-flexible-server.data.azuread_user.this["kacper@retoxxdev.onmicrosoft.com"]: Reading...
module.key-vault.data.azuread_service_principal.this[0]: Reading...
module.key-vault.data.azuread_user.this[0]: Reading...
module.key-vault.data.azuread_user.this[0]: Read complete after 0s [id=99d460c0-781f-46f8-9363-96fd28fd239e]
module.key-vault.data.azuread_service_principal.this[0]: Read complete after 0s [id=e3946406-60b1-416f-88a3-25740948103b]
module.postgresql-flexible-server.data.azuread_user.this["kacper@retoxxdev.onmicrosoft.com"]: Read complete after 0s [id=99d460c0-781f-46f8-9363-96fd28fd239e]
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu]
module.key-vault.data.azurerm_client_config.current: Reading...
module.postgresql-flexible-server.data.azurerm_client_config.current: Reading...
module.postgresql-flexible-server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xNjczZjhlMy0xYWIwLTQyYjctYjgwZS0zMTdlMTQzYTdjOWY7b2JqZWN0SWQ9OTQ1ZmJlNTYtMTAzYy00NGQ0LTg2OGQtMGI0MGJmZjAwZWIwO3N1YnNjcmlwdGlvbklkPTA5YmNmOGQ0LTM1ZWEtNDZmYy05MGQxLWI1MTNkNGMwMGQ1NDt0ZW5hbnRJZD00ZDAyZDZmMS0wYTIzLTQ2ZTctOWU0Yi02N2ZlMTVjY2M5ZDI=]
module.key-vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xNjczZjhlMy0xYWIwLTQyYjctYjgwZS0zMTdlMTQzYTdjOWY7b2JqZWN0SWQ9OTQ1ZmJlNTYtMTAzYy00NGQ0LTg2OGQtMGI0MGJmZjAwZWIwO3N1YnNjcmlwdGlvbklkPTA5YmNmOGQ0LTM1ZWEtNDZmYy05MGQxLWI1MTNkNGMwMGQ1NDt0ZW5hbnRJZD00ZDAyZDZmMS0wYTIzLTQ2ZTctOWU0Yi02N2ZlMTVjY2M5ZDI=]
module.container-registry.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu]
module.virtual-network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/virtualNetworks/vnet-sample-app-neu]
azurerm_private_dns_zone.kv: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.dns-zone.azurerm_dns_zone.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/dnsZones/dziedzic.me]
module.key-vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.KeyVault/vaults/kv-sample-app-neu]
module.kubernetes-cluster.azurerm_user_assigned_identity.this[0]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sample-app-neu]
module.virtual-network.azurerm_subnet.this["snet-sample-app-neu-postgres"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/virtualNetworks/vnet-sample-app-neu/subnets/snet-sample-app-neu-postgres]
module.virtual-network.azurerm_subnet.this["snet-sample-app-neu-aks"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/virtualNetworks/vnet-sample-app-neu/subnets/snet-sample-app-neu-aks]
azurerm_private_dns_zone_virtual_network_link.kv: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/vdn-kv-sample-app-neu]
azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com/virtualNetworkLinks/vdn-psql-sample-app-neu]
module.postgresql-flexible-server.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-sample-app-neu]
module.kubernetes-cluster.azurerm_kubernetes_cluster.this: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerService/managedClusters/aks-sample-app-neu]
module.postgresql-flexible-server.azurerm_postgresql_flexible_server_active_directory_administrator.this["kacper@retoxxdev.onmicrosoft.com"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-sample-app-neu/administrators/99d460c0-781f-46f8-9363-96fd28fd239e]
module.key-vault-secrets.azurerm_key_vault_secret.this["retoxx-dev-sso-ca"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/retoxx-dev-sso-ca/1e281f2502064a378234c4207e068832]
module.key-vault-secrets.azurerm_key_vault_secret.this["sample-app-messaging-dev-env"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/sample-app-messaging-dev-env/6c624dbb09484e04bc8082fac65d7dee]
module.key-vault-secrets.azurerm_key_vault_secret.this["sample-app-core-dev-env"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/sample-app-core-dev-env/bee93815fce94362a237f1090007b83e]
module.key-vault-secrets.azurerm_key_vault_secret.this["rabbitmq-password-dev"]: Refreshing state... [id=https://kv-sample-app-neu.vault.azure.net/secrets/rabbitmq-password-dev/284bf344e6be41a082d4126735fd92af]
module.key-vault.azurerm_private_endpoint.this[0]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/privateEndpoints/pep-kv-sample-app-neu]
module.dns-zone.azurerm_dns_a_record.this["*"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/dnsZones/dziedzic.me/A/*]
module.dns-zone.azurerm_dns_a_record.this["@"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.Network/dnsZones/dziedzic.me/A/@]
module.role-assignments.azurerm_role_assignment.principal_ids["AcrPull-e3946406-60b1-416f-88a3-25740948103b"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/437a2033-35c6-03ee-086d-d18f03bd1208]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-infra-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-messaging-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-client-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-core-githubactions"]: Reading...
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-infra-githubactions"]: Read complete after 0s [id=04218124-c797-45d6-bc34-294fc2f87af1]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-core-githubactions"]: Read complete after 0s [id=50284a0a-c2e6-484f-a5c1-26c1f612a774]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-messaging-githubactions"]: Read complete after 0s [id=ff75e804-3e39-4335-a603-cdd0ce98db4b]
module.role-assignments.data.azuread_service_principal.sp_objects["AcrPush-sampleapp-client-githubactions"]: Read complete after 0s [id=2fd74462-5a25-4371-b0e9-bef5a439f25e]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-messaging-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/2fcb77b0-0464-b757-75a9-7af94061b1ee]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-client-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/06d0ec2e-9d75-83c4-74ad-c4e3d7e5833b]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-core-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/19ec5d19-9fb4-dc1d-1324-97c296997823]
module.role-assignments.azurerm_role_assignment.service_principals["AcrPush-sampleapp-infra-githubactions"]: Refreshing state... [id=/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.ContainerRegistry/registries/acrsampleappneu/providers/Microsoft.Authorization/roleAssignments/51f13bc8-e76c-1081-1d52-e466eb4065be]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.key-vault.azurerm_key_vault.this will be updated in-place
  ~ resource "azurerm_key_vault" "this" {
        id                              = "/subscriptions/09bcf8d4-35ea-46fc-90d1-b513d4c00d54/resourceGroups/rg-sample-app-neu/providers/Microsoft.KeyVault/vaults/kv-sample-app-neu"
        name                            = "kv-sample-app-neu"
        tags                            = {}
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Allow" -> "Deny"
            # (3 unchanged attributes hidden)
        }
    }

  # module.storage-account-logs.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = true
      + is_hns_enabled                    = false
      + large_file_share_enabled          = false
      + location                          = "northeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "stsampleappneulogs"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-sample-app-neu"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled      = true
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }
    }

  # module.storage-account-logs.azurerm_storage_container.this["admin"] will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "admin"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "stsampleappneulogs"
    }

  # module.storage-account-logs.azurerm_storage_container.this["chunks"] will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "chunks"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "stsampleappneulogs"
    }

  # module.storage-account-logs.azurerm_storage_container.this["loki"] will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "loki"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "stsampleappneulogs"
    }

  # module.storage-account-logs.azurerm_storage_container.this["ruler"] will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "ruler"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "stsampleappneulogs"
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*